/*******************************************************************************
 *
 * MODULE :settings header file
 *
 * CREATED:2020/01/27 01:02:00
 * AUTHOR :Kakuheiki.Nakanohito
 *
 * DESCRIPTION:ファイルユーティリティ関係の関数群
 *
 * CHANGE HISTORY:
 *
 * LAST MODIFIED BY:
 *
 *******************************************************************************
 *
 * Copyright (c) 2024 Kakuheiki.Nakanohito
 * Released under the MIT license
 * https://opensource.org/licenses/mit-license.php
 *
 ******************************************************************************/
#ifndef __SETTINGS_H__
#define __SETTINGS_H__

#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************/
/***      Include files                                                     ***/
/******************************************************************************/

//==============================================================================
// 暗号化設定
//==============================================================================

//==============================================================================
// 各種設定
//==============================================================================
// microSDカードの接続モード
//#define USE_SDMMC_HSPI_MODE
#define USE_SDMMC_VSPI_MODE

#ifdef __cplusplus
}
#endif

#endif /* __SETTINGS_H__ */
